import time
import numpy
"""
有一个列表a，如何在不创建新列表的情况下对原有列表里面的每一个值加1

不创建新列表的原因：当你的a列表里有很多数据的时候，加入有100MB的数据，创建一个新列表会很占空间

"""
a = [1,3,4,5,6,7,9,10]
a = list(map(lambda x:x+1,a))
# a = map(lambda x:x+1,a)
print (a)
    #[2, 4, 5, 6, 7, 8, 10, 11]
"""
lambda是匿名函数，即不需要通过def命名函数。
x是函数内的参数，：后面是函数执行的运算
map方法是把函数和数据匹配到一起进行运算
随后list函数是把结果生成一个list，不加list返回的是一个迭代器：<map object at 0x0000024564839190>，需要for循环显示内容
"""

"""
高级方法：列表生成式

"""
b = [i+1 for i in a ]
print (b)
    #[3, 5, 6, 7, 8, 9, 11, 12]